vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-java-debug
vscjava.vscode-maven
vscjava.vscode-gradle
redhat.java
dart-code.flutter
nash.awesome-flutter-snippets
sickode.sk-flutter
robert-brunhage.flutter-riverpod-snippets
dart-code.dart-code
adelphes.android-dev-ext
pavi2410.android-devkit